import numpy as np

'''
修改数组的值
'''

# 将3列到4列的值改为0
a1 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a1[:, 2:4] = 0

# 数组中小于7的元素改为3
a2 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a2[a2<7] = 3

# 数组中小于7的改为0, 大于7的改为7
a3 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a4 = np.where(a3<7, 0, 7)  # numpy的三元运算符

# 给数组一个边界
a5 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a6 = a5.clip(3, 7)

# 数组的行交换
a7 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a7[[1,2], :] = a7[[2,1], :]

# 数组的列交换
a8 = np.array([[1,2,3,4],[5,6,7,8],[7,8,9,10]])
a8[:, [0,2]] = a8[:, [2,0]]
print(a8)